{
  "backend/main.mo": "Empty Motoko actor with no defined methods.",
  "feature_evidence.json": "Feature evidence report structure containing an empty features array.",
  "frontend-file-summaries.txt": "Text file containing prewritten summaries for various frontend source files.",
  "frontend/index.css": "Tailwind-based global stylesheet defining light and dark theme CSS variables and base styles.",
  "frontend/index.html": "HTML entrypoint with a root div and script loading the main TypeScript bundle.",
  "frontend/src/App.tsx": "Root component wrapping the app with TaskerProvider and rendering AppLayout.",
  "frontend/src/components/layout/AppLayout.tsx": "Main application layout controlling active section rendering and applying theme settings.",
  "frontend/src/components/layout/SidebarNav.tsx": "Sidebar navigation component with mobile and desktop variants and section switching.",
  "frontend/src/features/achievements/AchievementsSection.tsx": "Achievements dashboard showing weekly analytics, charts, and metrics with empty state handling.",
  "frontend/src/features/achievements/components/CompletionDonutChart.tsx": "Recharts donut chart visualizing completed versus pending tasks.",
  "frontend/src/features/achievements/components/WeeklyTrendChart.tsx": "Recharts bar chart showing daily task completion trends for the week.",
  "frontend/src/features/calendar/CalendarSection.tsx": "Calendar view allowing date selection, day creation, and viewing tasks for the selected date.",
  "frontend/src/features/calendar/components/SelectedDayTasks.tsx": "Renders tasks for a selected study day with progress, task list, and actions to toggle or delete tasks.",
  "frontend/src/features/dashboard/components/DayCard.tsx": "Shows a collapsible card for each study day including progress, tasks, and task creation form.",
  "frontend/src/features/dashboard/components/TaskForm.tsx": "Provides a form to create a new task with subject, chapter, type, priority, reward, xp, and notes.",
  "frontend/src/features/dashboard/DashboardSection.tsx": "Displays the dashboard with study days, streak info, and controls to add or reset days.",
  "frontend/src/features/pomodoro/PomodoroSection.tsx": "Implements a Pomodoro timer with modes, durations, task selection, and timer controls.",
  "frontend/src/features/settings/SettingsSection.tsx": "Allows users to customize theme settings including dark mode, accent color, and background image.",
  "frontend/src/hooks/useActor.ts": "Creates a backend actor tied to the current Internet Identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth state, login/logout handling, and loads persisted identities via AuthClient.",
  "frontend/src/hooks/usePersistedTaskerState.ts": "Loads, normalizes, migrates, and persists the Tasker app state in localStorage.",
  "frontend/src/hooks/usePomodoroTimer.ts": "Runs the Pomodoro countdown, handles completion logging, and exposes start/pause/reset controls.",
  "frontend/src/hooks/useThemeSettings.ts": "Applies theme settings such as dark mode, accent colors, and background images to the document root.",
  "frontend/src/hooks/useWeeklyAnalytics.ts": "Computes weekly task stats including totals, daily data, and subject breakdowns from stored days.",
  "frontend/src/index.css": "Defines Tailwind layers and CSS variables for theming, including light/dark modes and layout utilities.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/src/state/storageKeys.ts": "Defines legacy and current storage key names for state persistence.",
  "frontend/src/state/TaskerProvider.tsx": "Manages global Tasker state, updates days and tasks, handles pomodoro and theme updates, and persists changes.",
  "frontend/src/state/taskerTypes.ts": "Defines tasker-related TypeScript types and constants, including tasks, subjects, pomodoro settings, theme settings, and chapter lists.",
  "frontend/src/utils/id.ts": "Generates unique task IDs using crypto.randomUUID with a timestamp-based fallback.",
  "frontend/src/utils/storageKeys.ts": "Duplicate storage key definitions for legacy and current state keys.",
  "frontend/src/utils/taskerLogic.ts": "Provides task sorting, progress calculation, date utilities, and engagement streak logic.",
  "frontend/tailwind.config.js": "Configures Tailwind CSS theme, plugins, colors, typography, and animations.",
  "project_state.json": "Describes project state, issues, and pending feature requests including export option and file reduction."
}