{
  "backend/main.mo": "An empty Motoko actor placeholder with no logic implemented.",
  "feature_evidence.json": "Feature report mapping requested changes to affected frontend files and components with high-confidence traceability.",
  "frontend-file-summaries.txt": "A reference list summarizing major frontend files, their roles, and recent feature‑related updates.",
  "frontend/index.css": "Tailwind base theme variables for light and dark mode, defining color tokens and global background/foreground styles.",
  "frontend/index.html": "Basic HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Wraps the application in TaskerProvider and renders AppLayout.",
  "frontend/src/components/layout/AppLayout.tsx": "Main layout component switching between dashboard, calendar, pomodoro, achievements, and settings sections with applied theme settings.",
  "frontend/src/components/layout/SidebarNav.tsx": "Renders mobile and desktop sidebar navigation with icons and a footer showing 'Developed product by Aditya Verma'.",
  "frontend/src/features/achievements/AchievementsSection.tsx": "Displays weekly analytics, charts, and achievement stats with empty‑state handling when no data exists.",
  "frontend/src/features/achievements/components/CompletionDonutChart.tsx": "Recharts donut chart visualizing completed vs pending tasks using themed color variables.",
  "frontend/src/features/achievements/components/WeeklyTrendChart.tsx": "Recharts bar chart showing daily task completion trends for the current week.",
  "frontend/src/features/calendar/CalendarSection.tsx": "Renders a calendar view for selecting dates and viewing or creating study days with associated tasks.",
  "frontend/src/features/calendar/components/SelectedDayTasks.tsx": "Displays tasks for a selected study day with progress, task list, and controls to add, toggle, or delete tasks.",
  "frontend/src/features/dashboard/components/DayCard.tsx": "Represents an individual study day with date, progress, collapsible task list, and task management actions.",
  "frontend/src/features/dashboard/components/TaskForm.tsx": "Form component for adding a new task to a study day with subject, chapter, type, priority, and optional fields.",
  "frontend/src/features/dashboard/DashboardSection.tsx": "Shows an overview of all study days, allows adding days, resetting data, and displays streak info.",
  "frontend/src/features/pomodoro/PomodoroSection.tsx": "Implements a Pomodoro timer with mode switching, duration customization, and task selection integration.",
  "frontend/src/features/settings/SettingsSection.tsx": "UI for adjusting theme settings including dark mode, accent color, and background images or URLs.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on Internet Identity, invalidating dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context with login, logout, and identity persistence via AuthClient.",
  "frontend/src/hooks/usePersistedTaskerState.ts": "Loads, normalizes, migrates, and persists Tasker state from localStorage with defaults and legacy key support.",
  "frontend/src/hooks/usePomodoroTimer.ts": "Manages Pomodoro countdown timing, updates state, and logs task completions when focus sessions end.",
  "frontend/src/hooks/useThemeSettings.ts": "Applies theme settings to the document including dark mode, accent color, and background images.",
  "frontend/src/hooks/useWeeklyAnalytics.ts": "Computes weekly task analytics including totals, completion rates, daily stats, and subject breakdowns.",
  "frontend/src/index.css": "Tailwind-based global styles defining theme variables, dark mode overrides, and background utilities.",
  "frontend/src/main.tsx": "App entry point initializing React, QueryClient, Internet Identity provider, and global styles.",
  "frontend/src/state/storageKeys.ts": "Defines legacy and current localStorage keys for tasker state.",
  "frontend/src/state/TaskerProvider.tsx": "Provides the global tasker context with state persistence and actions for managing days, tasks, themes, pomodoro updates, and engagement streaks.",
  "frontend/src/state/taskerTypes.ts": "Declares TypeScript types for tasks, days, pomodoro settings, themes, and static chapter lists.",
  "frontend/src/utils/id.ts": "Generates unique task IDs using crypto.randomUUID with a timestamp fallback.",
  "frontend/src/utils/storageKeys.ts": "Exports the same storage key definitions as state/storageKeys for localStorage usage.",
  "frontend/src/utils/taskerLogic.ts": "Contains logic for sorting tasks, calculating progress, date handling, and updating the IST-based engagement streak.",
  "frontend/tailwind.config.js": "Configures Tailwind CSS theme, colors, fonts, animations, and plugin integrations.",
  "project_state.json": "Describes project requirements, issues, and feature requests related to IST streak logic, data persistence, and footer text updates."
}