{
  "backend/main.mo": "Empty Motoko actor with no logic.",
  "feature_evidence.json": "Feature evidence report containing an empty feature list.",
  "frontend-file-summaries.txt": "Prewritten summaries describing major frontend files and their functionality.",
  "frontend/index.css": "Tailwind-based global stylesheet defining light and dark theme CSS variables and base styles.",
  "frontend/index.html": "HTML entrypoint mounting the React root and loading the main TypeScript module.",
  "frontend/src/App.tsx": "Wraps the app in TaskerProvider and renders AppLayout.",
  "frontend/src/components/layout/AppLayout.tsx": "Main layout switching between app sections and applying theme settings.",
  "frontend/src/components/layout/SidebarNav.tsx": "Sidebar navigation with mobile and desktop variants and section switching.",
  "frontend/src/features/achievements/AchievementsSection.tsx": "Displays weekly analytics, charts, and stats with empty-state handling.",
  "frontend/src/features/achievements/components/CompletionDonutChart.tsx": "Recharts donut chart visualizing completed vs pending tasks.",
  "frontend/src/features/achievements/components/WeeklyTrendChart.tsx": "Recharts bar chart showing daily task completion trends.",
  "frontend/src/features/calendar/CalendarSection.tsx": "Calendar view for selecting dates and managing associated tasks.",
  "frontend/src/features/calendar/components/SelectedDayTasks.tsx": "Displays tasks for a selected day, showing progress, task list, and a form to add new tasks.",
  "frontend/src/features/dashboard/components/DayCard.tsx": "Shows an individual study day card with date, progress, collapsible task list, and a task form.",
  "frontend/src/features/dashboard/components/TaskForm.tsx": "Provides a form for creating a task with subject, chapter, type, priority, rewards, and notes.",
  "frontend/src/features/dashboard/DashboardSection.tsx": "Renders the main dashboard with study days, streak info, and controls for adding or resetting days.",
  "frontend/src/features/pomodoro/PomodoroSection.tsx": "Implements a Pomodoro timer with mode switching, duration settings, and optional task linking.",
  "frontend/src/features/settings/SettingsSection.tsx": "Offers settings for theme customization including dark mode, accent color, and background image options.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an authenticated or anonymous backend actor and refreshes dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth state, login/logout actions, and loads or creates identities via AuthClient.",
  "frontend/src/hooks/usePersistedTaskerState.ts": "Loads, normalizes, migrates, and persists tasker state in localStorage with validation of tasks and pomodoro settings.",
  "frontend/src/hooks/usePomodoroTimer.ts": "Manages a Pomodoro countdown timer, updates state each second, and logs task completions when focus sessions end.",
  "frontend/src/hooks/useThemeSettings.ts": "Applies theme preferences to the document, including dark mode, accent colors, and optional background images.",
  "frontend/src/hooks/useWeeklyAnalytics.ts": "Computes weekly task analytics including totals, daily stats, and subject breakdowns based on stored days.",
  "frontend/src/index.css": "Defines Tailwind layers and CSS variables for light/dark themes and layout styling.",
  "frontend/src/main.tsx": "Initializes the app root and wraps it with React Query and Internet Identity providers.",
  "frontend/src/state/storageKeys.ts": "Defines current and legacy localStorage keys for Tasker state.",
  "frontend/src/state/TaskerProvider.tsx": "Provides global tasker state, persistence, task management, pomodoro updates, and engagement streak handling.",
  "frontend/src/state/taskerTypes.ts": "Contains TypeScript types for tasks, study days, Pomodoro settings, theme settings, and subject chapter lists.",
  "frontend/src/utils/id.ts": "Generates unique task IDs using crypto.randomUUID or a timestamp-based fallback.",
  "frontend/src/utils/storageKeys.ts": "Duplicate storage key definitions for current and legacy Tasker state keys.",
  "frontend/src/utils/taskerLogic.ts": "Provides task sorting, day progress calculation, date utilities, and engagement streak logic.",
  "frontend/tailwind.config.js": "Configures Tailwind CSS with custom themes, colors, typography, animations, and plugin settings.",
  "project_state.json": "Describes project state, feature requests, known issues, and deployment goals for the app."
}